Rhino.Inside.Revit API
RectangleConverter.ToRectangle Method (Rectangle)
 Converts the specified Rectangle to an equivalent Autodesk.Revit.DB.Rectangle.
 Namespace: RhinoInside.Revit.Convert.System.Drawing
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.7.8130
Syntax
public static Autodesk.Revit.DB.Rectangle ToRectangle(
	this Rectangle rectangle
)
@staticmethod
def ToRectangle(
	rectangle: Rectangle
) -> Autodesk.Revit.DB.Rectangle
Parameters
rectangle
Type: System.Drawing.Rectangle
System rectangle to convert.
Return Value
Type: Autodesk.Revit.DB.Rectangle
Revit rectangle that is equivalent to the provided System rectangle.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Rectangle. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToRectangle(Rectangle) as extension method:
using System.Drawing;
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.System.Drawing;
DB.Rectangle revitRectangle = rectangle.ToRectangle();
import clr
clr.AddReference("System.Drawing")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
from System.Drawing import Rectangle
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.System.Drawing
clr.ImportExtensions(RhinoInside.Revit.Convert.System.Drawing)
revit_rectangle = rectangle.ToRectangle()    # type: DB.Rectangle
 Using ToRectangle(Rectangle) as static method:
using System.Drawing;
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.System.Drawing;
DB.Rectangle revitRectangle = RectangleConverter.ToRectangle(rectangle)
import clr
clr.AddReference("System.Drawing")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
clr.AddReference("Eto")
from System.Drawing import Rectangle
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.System.Drawing.RectangleConverter as RC
revit_rectangle = RC.ToRectangle(rectangle)    # type: DB.Rectangle
See Also
Reference
RectangleConverter Class
ToRectangle Overload
RhinoInside.Revit.Convert.System.Drawing Namespace